{
    "about": "**Hi, I'm Abderahmen Brinis 👋**  \n\nI'm a passionate Software Engineer in the making, currently pursuing my Bachelor's degree at **EPI Digital, Sousse-Tunisia** (2024-2027). Before that, I laid the foundation for my technical expertise with a Bachelor's in Computer Science from **ISITCOM** (2021-2024).  \n\nI specialize in modern programming languages like **Java, TypeScript, Python**, and frameworks such as **Angular, Nuxt.js, React.js**, and **Spring Boot**. My projects range from creating centralized business platforms to revolutionizing real estate technology.  \n\n---\n\n### **What I've Been Up To**  \n\n🚀 **Innovating Business Listings with AnnuPro**  \nDuring my **PFE Internship (2024)**, I designed and developed a centralized platform for managing business listings in Tunisia. Working with **DGTAL**, a leading French consulting agency, I implemented features like secure user authentication, admin dashboards, and advanced search functionality. Using **Nuxt.js 3, Spring Boot, Firebase**, and **Docker**, I delivered a user-friendly solution that streamlined the management of business information.  \n\n🏡 **Revolutionizing Real Estate with Houni.tn**  \nCurrently, I’m contributing to the development of an innovative real estate platform. My role involves enhancing property search features and streamlining management functionalities using a modern tech stack, including **Angular 18, Nuxt.js 3, and Node.js 18**.  \n\n---\n\n### **What Drives Me?**  \n\nMy goal is to create impactful, user-centric software that solves real-world problems. I aspire to lead projects that combine technology, creativity, and business insight. Beyond that, I’m a lifelong learner committed to staying ahead in the fast-evolving tech landscape.  \n\n---\n\n### **Fun Facts About Me**  \n\n- **Passionate Public Speaker**: I earned a certification in **Self-Confidence & Public Speaking** and enjoy engaging audiences with inspiring talks.  \n- **Tech Explorer**: I love exploring new frameworks and tools—my recent favorites are **Nuxt.js 3** and **Spring Boot**.  \n- **Creative Problem-Solver**: For me, coding is like solving a puzzle—it’s both challenging and deeply rewarding.  \n\n---",
    "imageSource": "images/about/profile.png"
  }
  